# Basic Metrics

When we think about summarizing data, what are the metrics that we look at?

In this notebook, we will look in the price of weed dataset along with the demographic information of the United States. 

To read how the data was acquired, please read [this](https://github.com/amitkaps/weed/blob/master/1-Acquire.ipynb) to get more information.

In [1]:
import numpy as np
import pandas as pd
from datetime import datetime as dt
from scipy import stats

### Read the input datasets. There are three datasets:

1. Weed price by date / state
2. Demographics of State
3. Population of state

In [11]:
prices_pd = pd.read_csv("../data/Weed_Price.csv", parse_dates=[-1])
demography_pd = pd.read_csv("../data/Demographics_State.csv")
population_pd = pd.read_csv("../data/Population_State.csv")

In [12]:
prices_pd.head()

        State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
0     Alabama  339.06    1042  198.64    933  149.49    123 2014-01-01
1      Alaska  288.75     252  260.60    297  388.58     26 2014-01-01
2     Arizona  303.31    1941  209.35   1625  189.45    222 2014-01-01
3    Arkansas  361.85     576  185.62    544  125.87    112 2014-01-01
4  California  248.78   12096  193.56  12812  192.92    778 2014-01-01

In [13]:
prices_pd.tail()

               State   HighQ  HighQN    MedQ  MedQN  LowQ  LowQN       date
22894       Virginia  364.98    3513  293.12   3079   NaN    284 2014-12-31
22895     Washington  233.05    3337  189.92   3562   NaN    160 2014-12-31
22896  West Virginia  359.35     551  224.03    545   NaN     60 2014-12-31
22897      Wisconsin  350.52    2244  272.71   2221   NaN    167 2014-12-31
22898        Wyoming  322.27     131  351.86    197   NaN     12 2014-12-31

In [14]:
demography_pd.head()

,region,total_population,percent_white,percent_black,percent_asian,percent_hispanic,per_capita_income,median_rent,median_age
0,alabama,4799277,67,26,1,4,23680,501,38.1
1,alaska,720316,63,3,5,6,32651,978,33.6
2,arizona,6479703,57,4,3,30,25358,747,36.3
3,arkansas,2933369,74,15,1,7,22170,480,37.5
4,california,37659181,40,6,13,38,29527,1119,35.4

In [15]:
population_pd.head()

       region     value
0     alabama   4777326
1      alaska    711139
2     arizona   6410979
3    arkansas   2916372
4  california  37325068

In [16]:
prices_pd.dtypes

State             object
HighQ            float64
HighQN             int64
MedQ             float64
MedQN              int64
LowQ             float64
LowQN              int64
date      datetime64[ns]
dtype: object

#### Sort the data on state and date, then fill NA values

In [17]:
prices_pd.sort_values(by=['State', 'date'], inplace=True)
prices_pd.fillna(method='ffill', inplace=True)

### Finding mean, median, mode, variance, standard deviation for California

#### Mean

arithmetic average of a range of values or quantities, computed by dividing the total of all values by the number of values.

In [32]:
california_pd = prices_pd[prices_pd.State == "California"].copy(True)
california_pd = california_pd.reset_index(drop = True)
california_pd.head()

        State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
0  California  248.77   12021  193.44  12724  193.88    770 2013-12-27
1  California  248.74   12025  193.44  12728  193.88    770 2013-12-28
2  California  248.76   12047  193.55  12760  193.60    772 2013-12-29
3  California  248.82   12065  193.54  12779  193.80    773 2013-12-30
4  California  248.76   12082  193.54  12792  193.80    773 2013-12-31

In [33]:
#Find the mean HighQ price in California

np.mean(california_pd['HighQ'])

245.37612472160356

#### Exercise: Find CA HighQ mean for 2013, 2014 & 2015 separately

*Hint:* `california_pd.iloc[0]['date'].year`

In [34]:
#we are adding a column to our dataframe with the year
import datetime
california_pd['year'] = pd.DatetimeIndex(california_pd['date']).year
california_pd.head()

        State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date  year
0  California  248.77   12021  193.44  12724  193.88    770 2013-12-27  2013
1  California  248.74   12025  193.44  12728  193.88    770 2013-12-28  2013
2  California  248.76   12047  193.55  12760  193.60    772 2013-12-29  2013
3  California  248.82   12065  193.54  12779  193.80    773 2013-12-30  2013
4  California  248.76   12082  193.54  12792  193.80    773 2013-12-31  2013

In [35]:
#find the HighQ mean for 2013, 2014, and 2015 using .loc

year_13 = california_pd.loc[california_pd['year'] == 2013] 
year_13.head()
mean_13 = round(np.mean(year_13['HighQ']), 2)
print("The CA HighQ mean for 2013 is", mean_13)

year_14 = california_pd.loc[california_pd['year'] == 2014] 
year_14.head()
mean_14 = round(np.mean(year_14['HighQ']), 2)
print("The CA HighQ mean for 2014 is", mean_14)

year_15 = california_pd.loc[california_pd['year'] == 2015] 
year_15.head()
mean_15 = round(np.mean(year_15['HighQ']), 2)
print("The CA HighQ mean for 2015 is", mean_15)

The CA HighQ mean for 2013 is 248.77
The CA HighQ mean for 2014 is 245.89
The CA HighQ mean for 2015 is 242.81

#### Median

Denotes value or quantity lying at the midpoint of a frequency distribution of observed values or quantities, such that there is an equal probability of falling above or below it. Simply put, it is the *middle* value in the list of numbers.

In [41]:
#count the number of rows in the california_pd dataframe
ca_count = california_pd.shape[0]
ca_count

#our count is odd, so the median value is (n-1)/2.  WE THINK THERE IS A TYPO IN THE STATEMENTS BELOW.
ca_median_index = (ca_count - 1)/2
ca_median_index

#the median value is at index 224

224.0

If count is odd, the median is the value at (n+1)/2,

else it is the average of n/2 and (n+1)/2

In [39]:
# Find the median price of HighQ weed in CA

#sort the HighQ values from low to high
price_sorted = california_pd.sort_values(by = 'HighQ')
price_sorted.head()

          State   HighQ  HighQN    MedQ  MedQN   LowQ  LowQN       date  year
432  California  241.84   18419  187.90  21965  188.6   1229 2015-05-26  2015
433  California  241.85   18450  187.90  21993  188.6   1231 2015-05-27  2015
417  California  241.87   18066  188.86  21561  188.6   1212 2015-05-11  2015
418  California  241.87   18073  188.89  21584  188.6   1213 2015-05-12  2015
431  California  241.88   18398  187.85  21949  188.6   1228 2015-05-25  2015

In [42]:
median = price_sorted.iloc[224]['HighQ']
median

245.31

#### Mode

It is the number which appears most often in a set of numbers.

In [16]:
# Find the HighQ price mode in CA

The most common price is CA, as indicated by its mode, is: 245.05

#### Variance

> Once two statistician of height 4 feet and 5 feet have to cross a river of AVERAGE depth 3 feet. Meanwhile, a third person comes and said, "what are you waiting for? You can easily cross the river"

It's the average distance of the data values from the *mean*

<img style="float: left;" src="img/variance.png" height="320" width="320">

In [18]:
# Find the variance of HighQ weed price in CA

Variance of High Quality weed prices in CA is: 2.98268628798

#### Standard Deviation

It is the square root of variance. This will have the same units as the data and mean.

In [19]:
# Find the standard deviation of HighQ weed price in CA

Standard Deviation of High Quality weed prices in CA is: 1.72704553732

#### Using Pandas built-in function
Compare the methods you tried above to the output from pd.describe, shown below.

In [27]:
california_pd.describe()

,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,year
count,449.000000,449.000000,449.000000,449.000000,449.000000,449.000000,449.000000
mean,245.376125,14947.073497,191.268909,16769.821826,189.783586,976.298441,2014.167038
std,1.727046,1656.133565,1.524028,2433.943191,1.598252,120.246714,0.402204
min,241.840000,12021.000000,187.850000,12724.000000,187.830000,770.000000,2013.000000
25%,244.480000,13610.000000,190.260000,14826.000000,188.600000,878.000000,2014.000000
50%,245.310000,15037.000000,191.570000,16793.000000,188.600000,982.000000,2014.000000
75%,246.220000,16090.000000,192.550000,18435.000000,191.320000,1060.000000,2014.000000
max,248.820000,18492.000000,193.630000,22027.000000,193.880000,1232.000000,2015.000000

#### Co-variance 

covariance as a measure of the (average) co-variation between two variables, say x and y. Covariance describes both how far the variables are spread out, and the nature of their relationship, Covariance is a measure of how much two variables change together. Compare this to Variance, which is just the range over which one measure (or variable) varies.

<img style="float: left;" src="img/covariance.png" height="270" width="270">

<br>
<br>
<br>
<br>

#### Co-variance of weed price in California vs New York
For the rest of the notebook, read through the code and understand how covariance and correlation are calculated.

In [28]:
ny_pd = prices_pd[prices_pd['State'] == 'New York'].copy(True)
ny_pd.head()

          State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
20120  New York  351.98    5773  268.83   5786  190.31    479 2013-12-27
20885  New York  351.92    5775  268.83   5786  190.31    479 2013-12-28
21599  New York  351.99    5785  269.02   5806  190.75    480 2013-12-29
22313  New York  352.02    5791  268.98   5814  190.75    480 2013-12-30
22823  New York  351.97    5794  268.93   5818  190.75    480 2013-12-31

In [31]:
ny_pd = ny_pd.iloc[:,[1,7]]
ny_pd.columns = ['NY_HighQ', 'date']

In [32]:
ny_pd.head()

       NY_HighQ       date
20120    351.98 2013-12-27
20885    351.92 2013-12-28
21599    351.99 2013-12-29
22313    352.02 2013-12-30
22823    351.97 2013-12-31

In [34]:
ca_ny_pd = pd.merge(california_pd.iloc[:,[1,7]].copy(), ny_pd, on="date")
ca_ny_pd.rename(columns={"HighQ": "CA_HighQ"}, inplace=True)
ca_ny_pd.head()

   CA_HighQ       date  NY_HighQ
0    248.77 2013-12-27    351.98
1    248.74 2013-12-28    351.92
2    248.76 2013-12-29    351.99
3    248.82 2013-12-30    352.02
4    248.76 2013-12-31    351.97

In [35]:
ny_mean = ca_ny_pd.NY_HighQ.mean()
ny_mean

346.9127616926502

In [36]:
ca_ny_pd['ca_dev'] = ca_ny_pd['CA_HighQ'] - ca_mean
ca_ny_pd.head()

   CA_HighQ       date  NY_HighQ    ca_dev
0    248.77 2013-12-27    351.98  3.393875
1    248.74 2013-12-28    351.92  3.363875
2    248.76 2013-12-29    351.99  3.383875
3    248.82 2013-12-30    352.02  3.443875
4    248.76 2013-12-31    351.97  3.383875

In [37]:
ca_ny_pd['ny_dev'] = ca_ny_pd['NY_HighQ'] - ny_mean
ca_ny_pd.head()

   CA_HighQ       date  NY_HighQ    ca_dev    ny_dev
0    248.77 2013-12-27    351.98  3.393875  5.067238
1    248.74 2013-12-28    351.92  3.363875  5.007238
2    248.76 2013-12-29    351.99  3.383875  5.077238
3    248.82 2013-12-30    352.02  3.443875  5.107238
4    248.76 2013-12-31    351.97  3.383875  5.057238

In [38]:
ca_ny_cov = (ca_ny_pd['ca_dev'] * ca_ny_pd['ny_dev']).sum() / (ca_count - 1)
print("Covariance of the High Quality weed prices in CA and NY is:", ca_ny_cov)

Covariance of the High Quality weed prices in CA and NY is: 5.91681496728842

#### Using Pandas built-in function

In [39]:
ca_ny_pd.cov()

          CA_HighQ   NY_HighQ    ca_dev     ny_dev
CA_HighQ  2.982686   5.916815  2.982686   5.916815
NY_HighQ  5.916815  12.245147  5.916815  12.245147
ca_dev    2.982686   5.916815  2.982686   5.916815
ny_dev    5.916815  12.245147  5.916815  12.245147

### Correlation

Extent to which two or more variables fluctuate together. A positive correlation indicates the extent to which those variables increase or decrease in parallel; a negative correlation indicates the extent to which one variable increases as the other decreases.

<img style="float: left;" src="img/correlation.gif" height="270" width="270">

<br>
<br>
<br>

#### Finding correlation between weed prices in New York and California

In [40]:
ca_highq_std = ca_ny_pd.CA_HighQ.std()
ny_highq_std = ca_ny_pd.NY_HighQ.std()

ca_ny_corr = ca_ny_cov / (ca_highq_std * ny_highq_std)
print("Correlation between weed prices in NY and CA:", ca_ny_corr)

Correlation between weed prices in NY and CA: 0.9790439611064712

In [41]:
ca_ny_pd.corr()

          CA_HighQ  NY_HighQ    ca_dev    ny_dev
CA_HighQ  1.000000  0.979044  1.000000  0.979044
NY_HighQ  0.979044  1.000000  0.979044  1.000000
ca_dev    1.000000  0.979044  1.000000  0.979044
ny_dev    0.979044  1.000000  0.979044  1.000000

# Correlation != Causation

correlation between two variables does not necessarily imply that one causes the other.


<img style="float: left;" src="img/correlation_not_causation.gif" height="570" width="570">